backend/app/controllers/api/v1/todos_controller.rb

    def index
      @todos = Todo.all
      limit = params[:_limit]

      if limit.present?
        limit = limit.to_i
        @todos = @todos.last(limit)
---
SELECT "todos".* FROM "todos"
SELECT "todos".* FROM "todos" ORDER BY "todos"."id" DESC LIMIT ?  [["LIMIT", 5]]

    def create
      @todo = Todo.new(todo_params)

      if @todo.save
---
INSERT INTO "todos" ("title", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "hello again"], ["completed", 0], ["created_at", "2022-02-07 02:42:13.608304"], ["updated_at", "2022-02-07 02:42:13.608304"]]

    def update
      if @todo.update(todo_params)
---
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 1], ["updated_at", "2022-02-07 02:47:26.351630"], ["id", 1]]

    def destroy
      @todo.destroy
---
DELETE FROM "todos" WHERE "todos"."id" = ?  [["id", 9]]

      def set_todo
        @todo = Todo.find(params[:id])
---
SELECT "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]